In [2]:
import pandas as pd

# Creating a DataFrame with book sales data
book_data = {
    "book_id": [201, 202, 203, 204, 205],
    "title": ["Python for Beginners", "Data Science with Python", "Advanced Python Programming", "Learning SQL", "Python for Data Analysis"],
    "author": ["John Doe", "Jane Smith", "John Doe", "Alice Johnson", "Jane Smith"],
    "price": [250, 300, 150, 180, 280],
    "copies_sold": [150, 200, 100, 90, 300]
}

books_df = pd.DataFrame(book_data)
print(books_df)

   book_id                        title         author  price  copies_sold
0      201         Python for Beginners       John Doe    250          150
1      202     Data Science with Python     Jane Smith    300          200
2      203  Advanced Python Programming       John Doe    150          100
3      204                 Learning SQL  Alice Johnson    180           90
4      205     Python for Data Analysis     Jane Smith    280          300

#### Books with price more than 200

In [3]:
books_df[books_df['price'] > 200]

   book_id                     title      author  price  copies_sold
0      201      Python for Beginners    John Doe    250          150
1      202  Data Science with Python  Jane Smith    300          200
4      205  Python for Data Analysis  Jane Smith    280          300

#### Books where price not greater than 200 and sold not less than 100 copies

In [4]:
books_df[(books_df['price'] <= 200) & (books_df['copies_sold'] >= 100)]

   book_id                        title    author  price  copies_sold
2      203  Advanced Python Programming  John Doe    150          100

#### Books written by John Doe or Jane Smith

In [5]:
books_df[books_df['author'].isin(['John Doe', 'Jane Smith'])]

   book_id                        title      author  price  copies_sold
0      201         Python for Beginners    John Doe    250          150
1      202     Data Science with Python  Jane Smith    300          200
2      203  Advanced Python Programming    John Doe    150          100
4      205     Python for Data Analysis  Jane Smith    280          300

#### Books where are word 'Python' in title

In [6]:
books_df[books_df['title'].str.contains('Python')]

   book_id                        title      author  price  copies_sold
0      201         Python for Beginners    John Doe    250          150
1      202     Data Science with Python  Jane Smith    300          200
2      203  Advanced Python Programming    John Doe    150          100
4      205     Python for Data Analysis  Jane Smith    280          300